#+HUGO_BASE_DIR: ~/hugo-export-tests
#+SITE_TARGET_SUBDIR: tests/hugo/site1
#+TITLE: Test Only


*** COMMENT hugo-render

Use command hugo-render to render the md files from the contents folder to the local webserver site folder using the =hugo= shell command. 
Here is an example tested successfully on 21 Jun 2019 11:07:

: hugo -b http://localhost/tests/test1/ -c ./content -d /usr/share/nginx/html/tests/test1/

Following second test confirms that the -c (content directory) path can be given in full (tested 21 Jun 2019 11:11)

: hugo -b http://localhost/tests/test2/ -c /home/iani/Dev/SITES/learn1/content -d /usr/share/nginx/html/tests/test2/

NOTE: The above did not work with =start-process= or with babel shell or even with multi-term terminal.  Hugo fails to finde any short codes for unknown reason. When removing short codes, it does not find the template for HTML and does not produce an index page. Possibly the environment is different. 

Therefore we try copying to clipboard, so that it can be pasted as a command in an external terminal, which works.

#+BEGIN_SRC emacs-lisp
(kill-new "Again: Hello World")
#+END_SRC

#+RESULTS:
: Again: Hello World

